In [1]:
import pandas as pd

# Series

In [2]:
#usando um array simples
data = [1,2,3,4,5]

In [3]:
s = pd.Series(data)

In [4]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
#alterando o índice
index = ['Linha' + str(i) for i in range(5)]

In [6]:
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [8]:
s = pd.Series(data = data, index = index)

In [9]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [10]:
#criando Series a partir de um dicionário do Python
data = {'linha' + str(i) : i +1 for i in range(5)}

In [11]:
data

{'linha0': 1, 'linha1': 2, 'linha2': 3, 'linha3': 4, 'linha4': 5}

In [12]:
s= pd.Series(data)

In [13]:
s

linha0    1
linha1    2
linha2    3
linha3    4
linha4    5
dtype: int64

In [14]:
#mudando a series
#permite operações matemáticas
s1 = s +2

In [15]:
s1

linha0    3
linha1    4
linha2    5
linha3    6
linha4    7
dtype: int64

In [16]:
#somando duas séries. Caso nao fosse possível somar, ele retornaria NaN
s2 = s + s1

In [18]:
s2

linha0     4
linha1     6
linha2     8
linha3    10
linha4    12
dtype: int64

# DataFrames

In [20]:
data = [[1,2,3], 
        [4,5,6], 
        [7,8,9]]

In [21]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [22]:
df1 = pd.DataFrame(data=data)

In [23]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [24]:
#criando rótulos
index = ['Linha' + str(i) for i in range(3)]

In [25]:
df1 = pd.DataFrame(data=data, index = index)

In [26]:
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [28]:
#Alterando as colunas
columns =  ['Coluna' + str(i) for i in range(3)]

In [29]:
df1 = pd.DataFrame(data=data, index = index, columns=columns)

In [30]:
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [31]:
#utilizando um dicionário
data = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [33]:
df2 = pd.DataFrame(data)

In [34]:
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [35]:
#passando uma lista de tuplas
#utilizando as variáveis index e columns criadas anteriormente
data = [(1,2,3), 
        (4,5,6), 
        (7,8,9)]

In [38]:
df3 =pd.DataFrame(data,index,columns)

In [39]:
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [46]:
#alterando os valores nos DFs
df1[df1 > '0'] = 'A'
df1

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [47]:
df2[df2 > '0'] = 'B' 
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [51]:
#não entendi pq tive que trocar os dois anteriores 0 para string e aqui não...
df3[df3 > 0] = 'C' 
df3

       Coluna0 Coluna1 Coluna2
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [52]:
#concatenando
#passando uma lista para concatenar
#concatena pelas colunas
df4 = pd.concat([df1, df2, df3])
df4

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [53]:
#concatenando pelas linhas
df4 = pd.concat([df1, df2, df3], axis=1)
df4

       Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2
Linha0       A       A       A       B       B       B       C       C       C
Linha1       A       A       A       B       B       B       C       C       C
Linha2       A       A       A       B       B       B       C       C       C